
===========================================================================
report_tns
============================================================================
tns -2003.15

===========================================================================
report_wns
============================================================================
wns -12.43

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -12.43

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.08
