
===========================================================================
report_tns
============================================================================
tns -44.49

===========================================================================
report_wns
============================================================================
wns -7.83

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -7.83

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.31
