
===========================================================================
report_tns
============================================================================
tns -177.43

===========================================================================
report_wns
============================================================================
wns -23.10

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -23.10

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 4.46
