
===========================================================================
report_tns
============================================================================
tns -10.34

===========================================================================
report_wns
============================================================================
wns -4.39

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -4.39

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 4.38
