
===========================================================================
report_tns
============================================================================
tns -21.16

===========================================================================
report_wns
============================================================================
wns -6.05

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -6.05

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 4.64
