
===========================================================================
report_tns
============================================================================
tns -565.47

===========================================================================
report_wns
============================================================================
wns -48.52

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -48.52

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 4.74
