
===========================================================================
report_tns
============================================================================
tns -510.46

===========================================================================
report_wns
============================================================================
wns -44.27

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -44.27

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 4.67
