
===========================================================================
report_tns
============================================================================
tns -207.16

===========================================================================
report_wns
============================================================================
wns -26.19

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -26.19

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 4.55
