
===========================================================================
report_tns
============================================================================
tns -2355.47

===========================================================================
report_wns
============================================================================
wns -14.11

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -14.11

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.08
