
===========================================================================
report_tns
============================================================================
tns -192.24

===========================================================================
report_wns
============================================================================
wns -24.65

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -24.65

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 4.50
