
===========================================================================
report_tns
============================================================================
tns -60.00

===========================================================================
report_wns
============================================================================
wns -10.61

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -10.61

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 4.94
