
===========================================================================
report_tns
============================================================================
tns -15584.68

===========================================================================
report_wns
============================================================================
wns -7.20

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -7.20

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.38
