
===========================================================================
report_tns
============================================================================
tns -246.67

===========================================================================
report_wns
============================================================================
wns -22.68

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -22.68

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 5.27
