
===========================================================================
report_tns
============================================================================
tns -177.98

===========================================================================
report_wns
============================================================================
wns -23.53

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -23.53

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 4.46
