
===========================================================================
report_tns
============================================================================
tns -0.18

===========================================================================
report_wns
============================================================================
wns -0.18

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -0.18

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.35
