
===========================================================================
report_tns
============================================================================
tns -617.77

===========================================================================
report_wns
============================================================================
wns -52.53

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -52.53

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 4.80
