
===========================================================================
report_tns
============================================================================
tns -193.04

===========================================================================
report_wns
============================================================================
wns -25.13

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -25.13

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 4.50
