
===========================================================================
report_tns
============================================================================
tns -226.57

===========================================================================
report_wns
============================================================================
wns -3.66

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -3.66

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.28
