
===========================================================================
report_tns
============================================================================
tns -14.11

===========================================================================
report_wns
============================================================================
wns -4.88

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -4.88

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 4.56
