
===========================================================================
report_tns
============================================================================
tns -22.45

===========================================================================
report_wns
============================================================================
wns -6.32

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -6.32

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 4.65
