
===========================================================================
report_tns
============================================================================
tns -3.09

===========================================================================
report_wns
============================================================================
wns -1.23

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -1.23

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.41
