
===========================================================================
report_tns
============================================================================
tns -20740.76

===========================================================================
report_wns
============================================================================
wns -8.44

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -8.44

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.40
