
===========================================================================
report_tns
============================================================================
tns -1289.16

===========================================================================
report_wns
============================================================================
wns -2.02

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -2.02

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.36
