
===========================================================================
report_tns
============================================================================
tns -1644.07

===========================================================================
report_wns
============================================================================
wns -10.64

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -10.64

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.07
