
===========================================================================
report_tns
============================================================================
tns -11.61

===========================================================================
report_wns
============================================================================
wns -3.93

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -3.93

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 4.12
