
===========================================================================
report_tns
============================================================================
tns -207.99

===========================================================================
report_wns
============================================================================
wns -26.76

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -26.76

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 4.55
